export const cho = {
  // the characters that you can type with key + shift
  ㄱ: {
    $: 'ㄱ',
    ㄱ: 'ㄲ',
  },
  ㄷ: {
    $: 'ㄷ',
    ㄷ: 'ㄸ',
  },
  ㅅ: {
    $: 'ㅅ',
    ㅅ: 'ㅆ',
  },
  ㅈ: {
    $: 'ㅈ',
    ㅈ: 'ㅉ',
  },
  ㅂ: {
    $: 'ㅂ',
    ㅂ: 'ㅃ',
  },
};
export const jung = {
  ㅗ: {
    $: 'ㅗ',
    ㅏ: 'ㅘ',
    ㅐ: 'ㅙ',
    ㅣ: 'ㅚ',
  },
  ㅜ: {
    $: 'ㅜ',
    ㅓ: 'ㅝ',
    ㅔ: 'ㅞ',
    ㅣ: 'ㅟ',
  },
  ㅡ: {
    $: 'ㅡ',
    ㅣ: 'ㅢ',
  },
};
export const jong = {
  ㄱ: {
    $: 'ㄱ',
    ㄱ: 'ㄲ',
    ㅅ: 'ㄳ',
  },
  ㄴ: {
    $: 'ㄴ',
    ㅈ: 'ㄵ',
    ㅎ: 'ㄶ',
  },
  ㄹ: {
    $: 'ㄹ',
    ㄱ: 'ㄺ',
    ㅁ: 'ㄻ',
    ㅂ: 'ㄼ',
    ㅅ: 'ㄽ',
    ㅌ: 'ㄾ',
    ㅍ: 'ㄿ',
    ㅎ: 'ㅀ',
  },
  ㅂ: {
    $: 'ㅂ',
    ㅅ: 'ㅄ',
  },
  ㅅ: {
    $: 'ㅅ',
    ㅅ: 'ㅆ',
  },
};
export const irregular = {
  is: 'irregular',
  ㄴ: {
    $: 'ㄴ',
    ㄴ: 'ㅥ',
    ㄷ: 'ㅦ',
    ㅅ: 'ㅧ',
    ㅿ: 'ㅨ',
  },
  ㄹ: {
    $: 'ㄹ',
    ㄱ: {
      isComplex: true,
      $: 'ㄺ',
      ㅅ: 'ㅩ',
    },
    ㄷ: 'ㅪ',
    ㅂ: {
      isComplex: true,
      $: 'ㄼ',
      ㅅ: 'ㅫ',
    },
    ㅿ: 'ㅬ',
    ㆆ: 'ㅭ',
  },
  ㅁ: {
    $: 'ㅁ',
    ㅂ: 'ㅮ',
    ㅅ: 'ㅯ',
    ㅿ: 'ㅰ',
  },
  ㅂ: {
    $: 'ㅂ',
    ㄱ: 'ㅲ',
    ㄷ: 'ㅳ',
    ㅅ: {
      isComplex: true,
      $: 'ㅄ',
      ㄱ: 'ㅴ',
      ㄷ: 'ㅵ',
    },
    ㅈ: 'ㅶ',
    ㅌ: 'ㅷ',
  },
  ㅅ: {
    $: 'ㅅ',
    ㄱ: 'ㅺ',
    ㄴ: 'ㅻ',
    ㄷ: 'ㅼ',
    ㅂ: 'ㅽ',
    ㅈ: 'ㅾ',
  },
  ㅇ: {
    $: 'ㅇ',
    ㅇ: 'ㆀ',
  },
  ㆁ: {
    $: 'ㆁ',
    ㅅ: 'ㆁ',
    ㅿ: 'ㅿ',
  },
  ㅎ: {
    $: 'ㅎ',
    ㅎ: 'ㆅ',
  },
  ㅛ: {
    $: 'ㅛ',
    ㅑ: 'ㆇ',
    ㅒ: 'ㆈ',
    ㅣ: 'ㆉ',
  },
  ㅠ: {
    $: 'ㅠ',
    ㅕ: 'ㆊ',
    ㅖ: 'ㆋ',
    ㅣ: 'ㆌ',
  },
  ㆍ: {
    $: 'ㆍ',
    ㅣ: 'ㆎ',
  },
};
// this file is sure complex...
